crates/orion-server/tests/benchmark/results/v0.2.0/D_multi_workflows.txt

Summary:
  Total:	15.0896 secs
  Slowest:	2.1602 secs
  Fastest:	0.0005 secs
  Average:	0.0072 secs
  Requests/sec:	6911.7796
  

Response time histogram:
  0.001 [1]	|
  0.216 [104149]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.432 [61]	|
  0.648 [43]	|
  0.864 [20]	|
  1.080 [10]	|
  1.296 [5]	|
  1.512 [2]	|
  1.728 [1]	|
  1.944 [2]	|
  2.160 [2]	|


Latency distribution:
  10%% in 0.0043 secs
  25%% in 0.0044 secs
  50%% in 0.0057 secs
  75%% in 0.0076 secs
  90%% in 0.0080 secs
  95%% in 0.0083 secs
  99%% in 0.0166 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0016 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0072 secs, 0.0005 secs, 2.1602 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	104296 responses